[
  {
    "slug": "php",
    "name": "PHP",
    "description": "PHP is a popular general-purpose scripting language that is especially suited to web development.",
    "icon": "devicon-php-plain"
  },
  {
    "slug": "js",
    "name": "JS",
    "description": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions.",
    "icon": "devicon-javascript-plain"
  },
  {
    "slug": "mysql",
    "name": "MySQL",
    "description": "MySQL is an open-source relational database management system.",
    "icon": "devicon-mysql-plain"
  },
  {
    "slug": "rails",
    "name": "Rails",
    "description": "Ruby on Rails, or Rails, is a server-side web application framework written in Ruby under the MIT License.",
    "icon": "devicon-rails-plain"
  },
  {
    "slug": "react",
    "name": "React",
    "description": "React is an open-source, front end, JavaScript library for building user interfaces or UI components.",
    "icon": "devicon-react-original"
  },
  {
    "slug": "threejs",
    "name": "ThreeJS",
    "description": "Three.js is a cross-browser JavaScript library and application programming interface used to create and display animated 3D computer graphics in a web browser.",
    "icon": "devicon-threejs-original"
  },
  {
    "slug": "typescript",
    "name": "TypeScript",
    "description": "TypeScript is an open-source language which builds on JavaScript, one of the world’s most used tools, by adding static type definitions.",
    "icon": "devicon-typescript-plain"
  },
  {
    "slug": "wasm",
    "name": "WASM",
    "description": "WebAssembly (often abbreviated wasm) is a binary instruction format for a stack-based virtual machine.",
    "icon": "devicon-wasm-original"
  },
  {
    "slug": "glsl",
    "name": "GLSL",
    "description": "GLSL is a C-style language for programming shaders.",
    "icon": "devicon-opengl-plain"
  },
  {
    "slug": "rust",
    "name": "Rust",
    "description": "Rust is a multi-paradigm programming language designed for performance and safety, especially safe concurrency.",
    "icon": "devicon-rust-plain"
  },
  {
    "slug": "bevy",
    "name": "Bevy",
    "description": "Bevy is a refreshingly simple data-driven game engine built in Rust."
  },
  {
    "slug": "multiplayer",
    "name": "Multiplayer",
    "description": "Multiplayer refers to more than one person playing a game at the same time in a non-campaign setting."
  },
  {
    "slug": "game",
    "name": "Game",
    "description": "Game development is the process of developing a video game."
  },
  {
    "slug": "bunjs",
    "name": "BunJS",
    "description": "BunJS is a lightweight JavaScript library for modern web development.",
    "icon": "devicon-bun-plain"
  },
  {
    "slug": "hotwire",
    "name": "Hotwire",
    "description": "Hotwire is an alternative approach to building modern web applications without using much JavaScript by sending HTML instead of JSON over the wire."
  },
  {
    "slug": "websockets",
    "name": "Websockets",
    "description": "WebSocket is a computer communications protocol, providing full-duplex communication channels over a single TCP connection."
  },
  {
    "slug": "astro",
    "name": "Astro",
    "description": "Astro is a front-end framework for building fast, optimized websites and applications.",
    "icon": "devicon-astro-plain"
  },
  {
    "slug": "blogging",
    "name": "Blogging",
    "description": "Blogging is the act of writing posts for a blog."
  },
  {
    "slug": "tmux",
    "name": "Tmux",
    "description": "Tmux is a terminal multiplexer for Unix-like operating systems."
  }
]
